# Data Analysis using Python
### By Julien Dhouti

This notebook will analyze the data using Python instead of R.

In [4]:
import pandas as pd
from sklearn import tree

In [18]:
df = pd.read_csv('../datasets/train_edited.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

Now that we have imported the dataset, we can seperate our test and training data into two seperate dataframes but first we should isolate the `dependent` and `independent variables` which is the survival rate for each person.

In [19]:
# isolate the dependent variable
y = df[['Survived']]

# isolate the independent variable
X = df[['Sex', 'Age', 'Fare', 'Pclass', 'Embarked']]
X.head()

      Sex   Age     Fare  Pclass Embarked
0    male  22.0   7.2500       3        S
1  female  38.0  71.2833       1        C
2  female  26.0   7.9250       3        S
3  female  35.0  53.1000       1        S
4    male  35.0   8.0500       3        S

Now that we have isolated the dependent variable, we can go ahead and start splitting the data to obtain the testing and training sets.

In [20]:
# We can use the train_test_split library from the model_selection package.
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)